
const data = [
  {
    "name": "张三",
    "SN": "1234657890",
    "level": "宽管",
    "item": "上账",
    "A": "244.50",
    "B": "0.00",
    "C": "0.00",
    "time": "2020-11-19 15:30:15"
  },
  {
    "name": "张三",
    "SN": "1234657890",
    "level": "宽管",
    "item": "上账",
    "A": "0.00",
    "B": "1000.00",
    "C": "0.00",
    "time": "2020-11-19 15:30:15"
  },
  {
    "name": "张三",
    "SN": "1234657890",
    "level": "宽管",
    "item": "下账",
    "A": "64.50",
    "B": "0.00",
    "C": "0.00",
    "time": "2020-11-19 15:30:15"
  },
  {
    "name": "张三",
    "SN": "1234657890",
    "level": "宽管",
    "item": "下账",
    "A": "0.00",
    "B": "162.30",
    "C": "16.71",
    "time": "2020-11-19 15:30:15"
  },
  {
    "name": "张三",
    "SN": "1234657890",
    "level": "宽管",
    "item": "上账",
    "A": "2000.00",
    "B": "0.00",
    "C": "0.00",
    "time": "2020-11-19 15:30:15"
  },
  {
    "name": "张三",
    "SN": "1234657890",
    "level": "宽管",
    "item": "上账",
    "A": "20.10",
    "B": "0.00",
    "C": "0.00",
    "time": "2020-11-19 15:30:15"
  },
  {
    "name": "张三",
    "SN": "1234657890",
    "level": "宽管",
    "item": "下账",
    "A": "0.00",
    "B": "120.00",
    "C": "0.00",
    "time": "2020-11-19 15:30:15"
  },
  {
    "name": "张三",
    "SN": "1234657890",
    "level": "宽管",
    "item": "上账",
    "A": "244.10",
    "B": "0.00",
    "C": "0.00",
    "time": "2020-11-19 15:30:15"
  },
  {
    "name": "张三",
    "SN": "1234657890",
    "level": "宽管",
    "item": "下账",
    "A": "0.50",
    "B": "0.00",
    "C": "120.00",
    "time": "2020-11-19 15:30:15"
  },
  {
    "name": "张三",
    "SN": "1234657890",
    "level": "宽管",
    "item": "下账",
    "A": "0.00",
    "B": "1000.00",
    "C": "0.00",
    "time": "2020-11-19 15:30:15"
  },
  {
    "name": "张三",
    "SN": "1234657890",
    "level": "宽管",
    "item": "下账",
    "A": "244.50",
    "B": "0.00",
    "C": "0.00",
    "time": "2020-11-19 15:30:15"
  },
  {
    "name": "张三",
    "SN": "1234657890",
    "level": "宽管",
    "item": "下账",
    "A": "244.50",
    "B": "0.00",
    "C": "0.00",
    "time": "2020-11-19 15:30:15"
  }
]


let _data = data.map(item => {
  return Object.values(item)
})

export const config = {
  headerBGC: "#092746",
  oddRowBGC: "#070e42",
  evenRowBGC: "#050a32",


  header: ['罪犯姓名', '罪犯编号', '处遇等级', "流向", "A账户", "B账户", "C账户", "时间"],
  data: _data,

  // index: true,

  columnWidth: Array(8).fill("").map(v => 74),
  align: Array(8).fill("").map(v => "center"),
  headerHeight: 42,
  rowNum: 8
}
